In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (1.0.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\sahil\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\sahil\appdata\roaming\python\python38\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

In [2]:
import pandas as pd

In [7]:
df = pd.DataFrame({
                    'name' : ["Sahil","Soham","pari"],
                    'gender' : ["Male","Male","Female"],
                    'age' : [26,27,25],
                })

In [8]:
df

    name  gender  age
0  Sahil    Male   26
1  Soham    Male   27
2   pari  Female   25

In [9]:
df.describe()

        age
count   3.0
mean   26.0
std     1.0
min    25.0
25%    25.5
50%    26.0
75%    26.5
max    27.0

In [10]:
subset_df = df[['name','age']]
subset_df

    name  age
0  Sahil   26
1  Soham   27
2   pari   25

In [11]:
groupby_df = df.groupby(by="gender").count()
groupby_df

        name  age
gender
Female     1    1
Male       2    2